admbase/src/Documents/ПеремещениеСотрудников/ПеремещениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеСотрудников</name>
  <registerRecords>InformationRegister.РазмещениеСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комната</name>
      <type>
        <types>CatalogRef.КомнатыВагоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/ИсторияРазмещенияСотрудников/ИсторияРазмещенияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРазмещенияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </resources>
  <resources>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументВыселения</name>
    <type>
      <types>DocumentRef.ПеремещениеСотрудников</types>
      <types>DocumentRef.ВыселениеСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/InformationRegisters/ЗанятыеМестаОбщежитие/ЗанятыеМестаОбщежитие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗанятыеМестаОбщежитие</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Documents/ПеремещениеСотрудников/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаселениеСотрудников") Тогда
		ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения, "ЗаселениеСотрудников");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеСотрудников") Тогда
		ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения, "ПеремещениеСотрудников");
	КонецЕсли;
	
	Отвественный = Пользователи.ТекущийПользователь();
	ДатаЗаселения = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщежитиеФункцииСервер.ПроверкаЗаселенных(Отказ,ДетальныеЗаписи,Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не Отказ Тогда
		ОбщежитиеФункцииСервер.ЗаписатьДатуВыселенияВИсториюРазмещенияСотрудников(Ссылка);
		ОбщежитиеФункцииСервер.ОсвободитьЗанятыеМестаОбщежитие(Ссылка);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремещениеСотрудников.Дата КАК Период,
	|	ПеремещениеСотрудников.Дата КАК ДатаЗаписи,
	|	ПеремещениеСотрудников.Ссылка КАК Регистратор,
	|	ПеремещениеСотрудников.АдресРегистрации,
	|	ПеремещениеСотрудников.ДатаЗаселения,
	|	ПеремещениеСотрудниковДетальныеЗаписи.Сотрудник,
	|	ПеремещениеСотрудниковДетальныеЗаписи.Комната,
	|	ПеремещениеСотрудниковДетальныеЗаписи.Место,
	|	ПеремещениеСотрудников.СтоимостьПроживания
	|ИЗ
	|	Документ.ПеремещениеСотрудников.ДетальныеЗаписи КАК ПеремещениеСотрудниковДетальныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеСотрудников КАК ПеремещениеСотрудников
	|		ПО ПеремещениеСотрудниковДетальныеЗаписи.Ссылка = ПеремещениеСотрудников.Ссылка
	|ГДЕ
	|	ПеремещениеСотрудниковДетальныеЗаписи.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеСотрудниковДетальныеЗаписи.НомерСтроки";

#КонецОбласти
  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ИсторияРазмещенияСотрудников.Добавить(),Выборка);
	КонецЦикла;
	
	Движения.ИсторияРазмещенияСотрудников.Записывать = Истина;
	
	Если Не Отказ Тогда
		ОбщежитиеФункцииСервер.ЗафиксироватьЗанятыеМестаОбщежитие(Выборка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДетальныеЗаписи.Очистить();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения,ИмяДокумента)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументДетальныеЗаписи.НомерСтроки КАК НомерСтроки,
	|	ДокументДетальныеЗаписи.Сотрудник
	|ИЗ
	|	РегистрСведений.ЗанятыеМестаОбщежитие КАК ЗанятыеМестаОбщежитие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%1.ДетальныеЗаписи КАК ДокументДетальныеЗаписи
	|		ПО ДокументДетальныеЗаписи.Сотрудник = ЗанятыеМестаОбщежитие.Сотрудник
	|ГДЕ
	|	ДокументДетальныеЗаписи.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

#КонецОбласти

	Запрос.Текст = СтрШаблон(Запрос.Текст,ИмяДокумента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДетальныеЗаписи.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти 

#КонецЕсли
